tutorials/channelFoam/channel395/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
parentDir=`dirname $PWD`
application=`basename $parentDir`

runApplication blockMesh
runApplication $application
runApplication postChannel
